if 10>5:           #მოცემული ფუნქცია მხოლოდ if-ფუნქციისგან განსხვავებით გვაძლევს შესაძლებლობას განვიხილოთ სხვა ვარიანტიც
    print("a")     #რაც გულისხმობს იმას რომ ამ შემთხვევაში თუ 10>5-ზე დაიპრინტება a..  და არ გადავა else-ზე
else:               
    print("b")      

if 5>10:                
    print("a")      # ამ შემთხვევაში რადგან 5 არ არის მეტი 10-ზე .. არ დაიპრინტებოდა შედეგად a.
else:               #ავტომატურად გადაახტებოდა წინა შედეგს და დაპრინტავდა b-ს
    print("b")       #ანუ ეს ფუნქცია გვეუბნება თუ if- არაა სწორი დაიპრინტოს b.

# input- ინფორმაციის შემტანი.. მიმწოდებელი.. output - გამომავალი .. ინფორმაციის გამომტანი

my_age = input("how old are you: ")  #ამ კოდის გაშვების შემდეგ ტერმინალში დაიპრინტება "how old are you: " 
#და ჩვენ ტერმინალშივე შევძლებთ პასუხის გაცემას.. მაგალითად 24. ამის შემდეგ My_age მიიღებს მნიშვნელობას 24
# input-მეთოდით შემოტანილი ცვლადი არის ყოველთვის str ფორმატის

print("i am " + my_age + " years old")  #დაიპრინტება "i am 24 years old"  მოცემულ წინადადებაში ყველა ცვლადი არის str ტიპის

age = 22   # ეს პროცესი არის გაზრდა (incrementation)
age += 5 
print(age)   # იქნება 27 ორივე უნდა იყოს ერთი ტიპის ცვლადი ინტეჯერი 

a = "20"
b = "30"
c = "40"
print(a+b+c) # შედეგი 203040 მხოლოდ ერთმანეთს მიეწებებიან 

print(int(a)+int(b)+int(c))  #შედეგი 90

print(a + b)   #შეკრება
print(a * b) #გამრავლება
print(a / b)  #გაყოფა ზუსტად , ათწილადის სახით მაგ; 3.14
print(a - b)  #გამოკლება
print(a % b)  # a-ს b-ზე გაყოფისას მიღებული ნაშთის მნიშვნელობა
print(a ** b) # a-ს აყვანა  b- ხარისხში
print(a // b)  # a-ს გაყოფისას  b-ზე ..მიღებული მთელი მნიშვნელობა.. ანუ ათწილადის ჩამოჭრა და დატოვება მთელი რიცხვის

