
name = "ana"

# name არის ცვლადი.
# = არის ცვლადის ინიციალიზაცია (inicialization).
# "ana" არის ცვლადის მნიშვნელობა.
# print შეგვიძლია ეკრანზე(ტერმინალში) გამოვიტანოთ ცვლადის მნიშვნელობა.

print(name)  #ტერმინალში გამოიტანს name-ცვლადის მნიშვნელობას რაც ამ შემთხვევაში არის ana.

print("dzroxa")  #ტერმინალში გამოიტანს dzroxa-ს.

name = "ana" # str(string)-ტიპის ცვლადი მაგ: "5" -ამ შემთხვევაში 5-არ აღიქმება ისე როგორც რიცხვი.
age = 22  # int(integer)-ტიპის ცვლადი არის მთელი რიცხვები.
height = 154.5  # float - ტიპის ცვლადი არის ათწილადები.. არა მთელი რიცხვები როგორიცაა 3.14 .
studing_programming = True # bool(boolean)- ტიპის ცვლადი რაც არის ლოგიკური ცვლადი რისი მნიშვნელობაც შეიძლება იყოს True ან False.
knows_programming = False   

print(type(age))  # ტერმინალში გამოგვიტანს ცვლადის ტიპს ამ შემთხვევაში int რადგან age არის ინტეჯერ ტიპის ცვლადი.
print(str+str)  # შეგვიძლია მხოლოდ ერთი ტიპის ცვლადების შეკრება(ერთმანეთზე მიწებება), თუ არის სხვადასხვა ტიპის ცვლადები უნდა შევუცვალოთ ტიპი

name = "ana"
surname = "darbaiseli"
age = 24
print(name + "" + surname + "" + age) # ეს იქნება ერორი რადგან name/surname=str age=int
str(age)  # გარდაქმნის str ტიპის ცვლადად 
print(name + "" + surname + "" + str(age))  # ტერმინალში გამოიტანს ana darbaiseli 24 / + "" გვჭირდება ადგილის გამოსატოვებლად წინადადებაში