# ვერ ვარჩევ ფუნქციას ობიექტს და მეთოდებს შესაბამისად ამ სიტყვებით აღწერილი რაღაცეები არ დაიმახსოვროთ

if True:          #ეს არის ლოგიკური ფუნქცია რაც გულისხმობს თუ if-ის მარჯვნივ მდგომი იქნება სიმართლე მაშინ შესრულდება 
    print("1")     #<< მის ქვემოთ მდებარე ფუნქცია და ტერმინალში გამოიტანს 1-იანს
    
if 10>5:                #ამ შემთხვევაში რადგან 10 მეტია 5 ზე ტერმინალში გამოიტანს true-ს, if-მარჯვნივ მოცემული პირობა უნდა იყოს True ან False არაფერი სხვა.
    print("true")    # იმ შემთხვევაში თუ ეს ზევით გვიწერია 3>5 ზე . არაფერს გამოიტანს ტერმინალში რადგან ეს არ არის ჭეშმარიტი . 
                     # ამ ფუნქციაში იწერება bool ან int ტიპის ცვლადები,ქვედა მხარე უნდა იყოს Tab-ღილაკით გამოყოფილი(ინდენტაცია(indentation))

print("{0}{1}{2}".format(("a", "b", "c"))) # format მეთოდი გამოიყენება ამ პრინციპით და მოცემულ {} ფრჩხილებში სვამს შემდეგ ობიექტებს 


 #მაგალითად  

name = "ana"
surname = "darbaiseli" 
age = 24
print("chemi saxelia {0}, me var {2} wlis, chemi gvaria {1}".format(name, surname, age))   # 0,2,1 განსაზღვრავს name surname და age ის მდებარეობას. ათვლა იწყება 0 დან
#ამ შემთხვევაში ტერმინალში გვექნება "chemi saxelia ana, me var 24 wlis, chemi gvaria darbaiseli"

print("chemi saxelia {} chemi gvaria {} me var {} wlis".format(name, surname, age))  # ამ შემთხვევაში ტერმინალში "chemi saxelia ana chemi gvaria darbaiseli me var 22 wlis"
#თუ ჩვენ არ მივანიჭებთ ადგილებს ფრჩხილებში {}- იგულისხმება 0,1,2 თანმიმდევრობა.. და name surname age -ჩაჯდება წინადადებაში ამ თანმიმდევრობით

#დიდი string-ის დასაწერად ვიყენებთ გრძელ ბრჭყალებს """გრძელი წინადადება"""
name = "ana"
print(name.capitalize()) # ეს ფუნქცია სახელში პირველ ასოს გაადიდებს.. და გამოგვიტანს შედეგს Ana, ყველა მეთოდს აქვს ().
print(name[0]) #a-ასოს დაპრინტავს რადგან ის არინ 0-ადგილას, print(name[1]) n-ასოს დაპრინტავს.. ათვლა იწყება 0-დან

full_name = "ana darbaiseli"
print(full_name[7])  #დაიპრინტება b- space-ითვლება სიმბოლოდ და ბ არის 7-ადგილზე

print(full_name[2:7]) #დაიპრინტება 2-დან 7-მდე დიაპაზონი .. "a dar" 
print(len(full_name)) #შედეგი იქნება 14 რადგან ობიექტი შედგება 14 სიმბოლოსგან, len(length)-სიგრძე

if "d" in full_name:   #შევამოწმოთ full_name-ში გვხვდება თუ არა ასო d, ამშემთხვევაში ტერმინალში გამოიტანს "gvxvdeba"
    print("gvxvdeba")   #თუ გვხვდება ეს დაიპრინტება შედეგში ხოლო თუ არ გვხვდება არ დაიპრინტება არაფერი

if "d" not in full_name:   #საპირისპირო ლოგიკით ^^^^^
    print("ar gvxvdeba")

full_name = "ana darbaiseli"
print(full_name[2:])  #დაიპრინტება 2-დან(დან) ბოლომდე  შედეგი: a darbaiseli
print(full_name[:2])  #დასაწყისიდან ბოლოდან მე2-მდე (მდე) შედეგი: ana darbaise
print(full_name[::2]) #დასაწყისიდან მიყვება და დაწერს ყოველ მეორე სიმბოლოს შედეგი: aadrasl
print(full_name[::3]) #იგივე პრინციპი^^^ ყოველი მე-3
print(full_name[-1])  #დაიპრინტება ბოლო სიმბოლო რომელიც იმყოფება -1-პოზიციაზე
print(full_name[-1:-4:-1]) #იქნება -1-დან(დან) .. -4-მდე (მდე).. ბოლო -1 აღნიშნავს იმას რომ თვლა ხდება უკუღმა შედეგი: ile
print(full_name[5:1:-1])  #მე-5 დან 1 მდე დაიპრინტება უკუღმა.. ანუ შედეგი : ad n
print(full_name[7:1:-2]) #ყოველი მეორე დაიპრინტება უკუღმა 7-დან 1 მდე 
print(full_name.upper()) #ყველა ასოს გაადიდებს შედეგი: ANA DARBAISELI
full_name = " ANA DARBAISELI"
print(full_name.lower())  #ყველა ასოს დააპატარავებს შედეგი: ana darbaiseli

full_name = "   ana   "
print(full_name.strip())  #დასაწყისში და დასასრულში ჩამოაშორებს ზედმეტ ცარიელ ადგილებს.. სფეისებს.. შედეგი: ana

name = "2 ana"
print(name.replace("2", "222")) # 2-იანს ჩაანაცვლებს 222-ით.. შედეგი: "222 ana"
print(name.replace("n", "a"))   # შედეგი "2 aaa"  n-ს ჩაანაცვლებს a-თი,, იმავე ხერხით ეგვიძლია გამოტოვებული ადგილები გარდავქმნათ სიმბოლოებათ






