a = 5
a +=5   
print(a)   #შედეგი იქნება 10. რადგან a- გაიზრდება 5-ით..
#ასევე შეგვიძლია გამოვიყენოთ სხვა მოქმედებები როგორიცაა
a /= 3   # a=a/3>>a=5/3
a *=5   # a = a * 5 >>> a = 5 * 5
a /=5  # a = a/3 პასუხი იქნება =1.0 float-ტიპის და შეგვიზლია გავხადოთ ინტეჯერი
a //=5 # int type = 1 ....ეს არის უბრალოდ შემოკლებული ტოლობები
 
#nested conditional
my_name = "ana"
for char in my_name: # for-ციკლის დროს დაიპრინტება my_name-ში მოცემული ცვლადის თითოეული სიმბოლო სათითაოდ
    print(char)       #შედეგი იქნება a   n    a , გამოიყენება str -ტიპის ცვლადზე

for i in range(10):  #შედეგი 0,1,2,3,4,5,6,7,8,9.
    print(i)          # გამოიყენება რიცხვებში, i-არის საიტერაციო ცვლადი , ციკლში იცვლის მნიშვნელობას

for i in range(10):
    print(str(i) + "a")   #შედეგი იქნება 0a, 1a, 2a, ... 9a.

for i in my_name:
    if i in "aeiou":   # თუ my_name ციკლის დროს , i- ასოები არის ხმოვანი ანუ გვხვდება აეიოუ-ში

